/**
 * @author XGLins
 * @date 2024/5/8 14:44
 *
 * if分支：
 *    if单分支
 *       if(布尔类型的表达式){
 *           分支内容;
 *       }
 *    if双分支
 *       if(布尔类型的表达式){
 *         分支内容1;
 *       }else{
 *         分支内容2;
 *       }
 *    if多分支
 *    if(布尔类型的表达式1){
 *        分支内容1;
 *    }else if(布尔类型的表达式2){
 *        分支内容2;
 *    }else{
 *        分支内容3;
 *    }
 * 注意：
 *    1.如果没有大括号 则只对距离它最近的语句有效
 *    2.判断闰年的标准
 *      2.1 能被400整除
 *      2.2能被4整除 并且 不能被100整除
 *    3.简单的if双分支可以被条件运算符代替
 */
public class IfTest5 {

    public static void main(String[] args) {
        /*
        计算如下函数：x和y的关系满足如下：
        （1）x>=3;    y=2x+1
        （2）-1<=x<3  y=2x
        （3）x<-1     y=2x-1
        */

    }

}
