package homeworkThree;

/**
 * @author XGLins
 * @date 2024/4/21 0:05
 *
 * 7、分析如下代码的计算结果
 */
public class Homework7 {
    public static void main(String[] args) {
        int a = 8, b = 3;
        System.out.println(a>>>b);//1
        /*
        8的二进制：00000000 00000000 00000000 00001000
        8>>>3：   00000000 00000000 00000000 00000001
         */
        System.out.println(a>>>b | 2);//3
        /*
        8的二进制：00000000 00000000 00000000 00001000
        8>>>3：   00000000 00000000 00000000 00000001
        2的二进制：00000000 00000000 00000000 00000010
        a>>>b | 2：00000000 00000000 00000000 00000011
         */
    }
}
